10/data/attachments/8e9218ec3ee97c4a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d71527df-6a9b-4f82-8964-1eb218cb90b6</nif:username>
            <nif:friendToBeAdded>Jose_evidence_Friend_1821_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>